{
    "DEVICE_WYAPP_WEBSOCKET_SOCKET_CONNECTED": {
        "message": "Authentifié auprès du serveur de périphériques",
        "description": "The notification the user sees when authetnicated with the devices server"
    },
    "DEVICE_WYAPP_WEBSOCKET_SOCKET_ERROR": {
        "message": "Erreur du serveur",
        "description": "The error notification the user sees with the error for the websocket server"
    },
    "DEVICE_WYAPP_WEBSOCKET_SOCKET_DISCONNECTED": {
        "message": "Déconnecté du serveur de périphériques ",
        "description": "The notification the user sees when disconnected from the devices server"
    },
    "DEVICE_WYAPP_WEBSOCKET_INSTANCE_RESET_TITLE": {
        "message": "Utiliser Studio ici?",
        "description": "The title of the question dialog the user sees when there is another connection with his id"
    },
    "DEVICE_WYAPP_WEBSOCKET_INSTANCE_RESET": {
        "message": "Une autre instance de Studio est connectée au serveur avec votre identifiant. Vous ne pouvez pas utiliser plusieurs connexions. Voulez-vous utiliser Studio ici?",
        "description": "The question dialog text the user sees when there is another instance connected with his id"
    },
    "DEVICE_WYAPP_WEBSOCKET_NEW_DEVICE_TITLE": {
        "message": "Ajouter un périphérique",
        "description": "The title of the dialog with instructions on how to add a new device"
    },
    "DEVICE_WYAPP_WEBSOCKET_NEW_DEVICE_NAME": {
        "message": "Nom du périphérique",
        "description": "The name of the device with instructions on how to add a new device"
    },
    "DEVICE_WYAPP_WEBSOCKET_NEW_DEVICE_NAME_NOT_VALID": {
        "message": "Veuillez entrer un nom de périphérique valide",
        "description": "The message the user receives when he did not enter a valid name for a new device"
    },
    "DEVICE_WYAPP_WEBSOCKET_SET_USER_ID_TITLE": {
        "message": "ID de la session",
        "description": "The dialog title where the user changes the session id"
    },
    "DEVICE_WYAPP_WEBSOCKET_SET_USER_ID_TEXT": {
        "message": "Identifiant unique utilisé pour se connecter aux appareils, similaire à un mot de passe.",
        "description": "The text dispalyed in the dialog where the user changes the session id"
    },
    "DEVICE_WYAPP_WEBSOCKET_SET_USER_ID_NO_UUID": {
        "message": "L'ID de la session doit doit être un UUID valide.",
        "description": "The error the user is shown when the enetered session id is not a valid"
    },
    "DEVICE_WYAPP_WEBSOCKET_SET_USER_ID": {
        "message": "ID de la session",
        "description": "The menu item where the user changes the session id"
    }
}